


/* Swift 프로그래밍 1장. Swift 소개와 개발 환경 */



    // 1.1 Swift 개요

        // - 2023년 현재, iOS 16, Swift 5.6~5.7, Xcode 14

        // - Objective C의 단점을 개선한 프로그래밍 언어

        // - 특징
            // (1) 클로저, 튜플, 제네릭, 함수형 프로그래밍
            // (2) nil에 대한 강박증에 가까운 처리
            // (3) 타입 세이프, 타입 체크 강화
            // (4) 플레이그라운드 (테스트 환경)

        
    // 1.2 개발 환경

        // - 종류
            // (1) 플레이그라운드 (REPL, 프로젝트 생성 불필요, 결과 바로 확인)
            // (2) iOS, MacOS 프로젝트 (선택 환경마다 실행 환경이 조금 다름, 개발 프로젝트 내 플레이 그라운드 포함 가능)
            // (3) 콘솔 기반 실행
            // (4) 온라인 Swift 환경


    // 1.3 개발자 사이트

        // - Swift 개발 지원 사이트

            // (1) swift.org : 오픈 소스
                // >> 도큐먼트, 다운로드, 소스코드, 프로젝트

            // (2) developer.apple.com/swift : 애플 개발자 사이트
                // >> iOS, macOS 개발 자료, 개발자 컨퍼런스 자료


